app/controllers/favorite_theses_controller.rb

SELECT "favorite_theses".* FROM "favorite_theses" WHERE "favorite_theses"."user_id" = ?  [["user_id", 1]]
---
  def index
    @favorite_theses = FavoriteThese.order(params[:sort]).where(user_id: session[:user_id]).all

INSERT INTO "favorite_theses" ("ttype", "title", "institution", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @favorite_thesis = FavoriteThese.find_or_create_by(favorite_thesis_params)

SELECT  "favorite_theses".* FROM "favorite_theses" WHERE "favorite_theses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_favorite_thesis
      @favorite_thesis = FavoriteThese.find(params[:id])