app/controllers/favorite_projects_controller.rb

SELECT "favorite_projects".* FROM "favorite_projects" WHERE "favorite_projects"."user_id" = ?  [["user_id", 1]]
---
  def index
    @favorite_projects = FavoriteProject.order(params[:sort]).where(user_id: session[:user_id]).all

INSERT INTO "favorite_projects" ("title", "form", "abstract", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @favorite_project = FavoriteProject.find_or_create_by(favorite_project_params)

SELECT  "favorite_projects".* FROM "favorite_projects" WHERE "favorite_projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_favorite_project
      @favorite_project = FavoriteProject.find(params[:id])