app/controllers/favorite_courses_controller.rb

  def index
    @favorite_courses = FavoriteCourse.order(params[:sort]).where(user_id: session[:user_id]).all
---
SELECT "favorite_courses".* FROM "favorite_courses" WHERE "favorite_courses"."user_id" = ? ORDER BY created_at  [["user_id", 1]]

  def create
    @favorite_course = FavoriteCourse.find_or_create_by(favorite_course_params)
---
INSERT INTO "favorite_courses" ("title", "objective", "teachingcontent", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_favorite_course
      @favorite_course = FavoriteCourse.find(params[:id])
---
SELECT  "favorite_courses".* FROM "favorite_courses" WHERE "favorite_courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]